[
  {
    "english_name": "Bharadvaja’s Twist",
    "sanskrit_name": "Bharadvajasana I",
    "pose_meta": [
      "Hip Opening",
      "Seated",
      "Twist"
    ],
    "difficulty": 1,
    "id": 0,
    "description": "To practice Bharadvaja's Twist, you can follow these steps: 1. Begin by sitting on the floor with your legs extended in front of you. 2. Bend your knees and shift your weight to the right hip. 3. Bring your feet to the left side of your body, stacking your knees on top of each other. 4. Inhale and lengthen your spine. 5. Exhale and twist to the right, placing your left hand on your right knee and your right hand on the floor behind you. 6. Hold the twist for 5-10 breaths, then repeat on the other side."
  },
  {
    "english_name": "Big Toe Pose",
    "sanskrit_name": "Padangusthasana",
    "pose_meta": [
      "Forward Bend",
      "Standing"
    ],
    "difficulty": 1,
    "id": 1,
    "description": "Begin by standing with your feet hip-width apart, keeping your spine straight and shoulders relaxed. Exhale and bend forward from your hips, keeping your knees straight or slightly bent if needed. Reach down with your hands and hold your big toes with your thumb, index, and middle fingers. If you can't reach your toes, you can use a strap or hold onto your ankles or shins. With each inhale, lengthen your spine and look forward. With each exhale, fold deeper into the pose, bringing your chest closer to your thighs. Try to straighten your legs as much as you comfortably can, but don't strain or force them to be completely straight. Keep your weight balanced between the balls and heels of your feet, and actively engage your quadriceps to support your legs. Relax your neck and let your head hang, allowing any tension to release. Hold the pose for 5-10 breaths, breathing deeply and maintaining a steady, relaxed breath."
  },
  {
    "english_name": "Boat Pose",
    "sanskrit_name": "Paripurna Navasana",
    "pose_meta": [
      "Core",
      "Seated",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 2,
    "description": "Sit on the floor with your legs extended. Bend your knees, then lean back slightly and lift your feet off the ground, balancing on your sit bones. Extend your arms forward, parallel to the floor. Straighten your legs as much as you can, forming a V-shape with your body. Keep your back straight and hold for 5-10 breaths."
  },
  {
    "english_name": "Bound Angle Pose",
    "sanskrit_name": "Baddha Konasana",
    "pose_meta": [
      "Forward Bend",
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 1,
    "id": 3,
    "description": "Sit with your legs extended, then bend your knees and bring the soles of your feet together. Hold your feet with your hands, and gently press your knees towards the floor. Keep your spine straight and hold for several breaths."
  },
  {
    "english_name": "Bow Pose",
    "sanskrit_name": "Dhanurasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 4,
    "description": "Lie on your stomach with your arms by your sides. Bend your knees and reach back to hold your ankles. Inhale and lift your chest and thighs off the floor, pulling your ankles up and back. Hold for several breaths."
  },
  {
    "english_name": "Bridge Pose",
    "sanskrit_name": "Setu Bandha Sarvangasana",
    "pose_meta": [
      "Backbends"
    ],
    "difficulty": 2,
    "id": 5,
    "description": "Lie on your back with your knees bent and feet flat on the floor, hip-width apart. Place your arms alongside your body with palms facing down. Press your feet and arms into the floor as you lift your hips towards the ceiling. Hold for several breaths."
  },
  {
    "english_name": "Camel Pose",
    "sanskrit_name": "Ustrasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 6,
    "description": "Kneel on the floor with your knees hip-width apart. Place your hands on your lower back with your fingers pointing down. Press your hips forward and lean back, reaching for your heels. Lift your chest and hold for several breaths."
  },
  {
    "english_name": "Cat Pose",
    "sanskrit_name": "Marjaryasana",
    "pose_meta": [
      "Core"
    ],
    "difficulty": 1,
    "id": 7,
    "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees under your hips. On an exhale, round your spine towards the ceiling, tucking your chin to your chest. Inhale and return to a neutral spine."
  },
  {
    "english_name": "Cat Cow Pose",
    "sanskrit_name": "Chakravakasana",
    "pose_meta": [
      "Backbends"
    ],
    "difficulty": 1,
    "id": 8,
    "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees under your hips. Inhale, arch your back, and lift your head and tailbone towards the ceiling (Cow Pose). Exhale, round your spine and tuck your chin to your chest (Cat Pose). Repeat for several breaths."
  },
  {
    "english_name": "Knees, Chest and Chin Pose",
    "sanskrit_name": "Ashtanga Namaskara",
    "pose_meta": [
      "Core"
    ],
    "difficulty": 1,
    "id": 9,
    "description": "Begin in a plank position. Lower your knees to the floor, then lower your chest and chin, keeping your elbows close to your body. Your hips should remain slightly lifted. Hold for a few breaths."
  },
  {
    "english_name": "Chair Pose",
    "sanskrit_name": "Utkatasana",
    "pose_meta": [
      "Core",
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 10,
    "description": "Stand with your feet together. Inhale and raise your arms above your head. Exhale and bend your knees, lowering your hips as if you are sitting back into a chair. Keep your chest lifted and hold for several breaths."
  },
  {
    "english_name": "Child’s Pose",
    "sanskrit_name": "Balasana",
    "pose_meta": [
      "Forward Bend",
      "Hip Opening",
      "Restorative"
    ],
    "difficulty": 1,
    "id": 11,
    "description": "Kneel on the floor and sit back on your heels. Exhale and fold forward, bringing your forehead to the floor. Extend your arms in front of you or rest them alongside your body. Hold for several breaths."
  },
  {
    "english_name": "Cobra Pose",
    "sanskrit_name": "Bhujangasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 1,
    "id": 12,
    "description": "Lie on your stomach with your hands under your shoulders. Press into your hands to lift your chest off the floor. Keep your elbows slightly bent and hold for several breaths."
  },
  {
    "english_name": "Corpse Pose",
    "sanskrit_name": "Savasana",
    "pose_meta": [
      "Restorative"
    ],
    "difficulty": 1,
    "id": 13,
    "description": "Lie on your back with your legs extended and arms at your sides, palms facing up. Close your eyes and relax your entire body, allowing it to sink into the floor. Hold for several minutes."
  },
  {
    "english_name": "Cow Face Pose",
    "sanskrit_name": "Gomukhasana",
    "pose_meta": [
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 2,
    "id": 14,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Bring your left foot to the outside of your right hip. Inhale and lengthen your spine, then exhale and twist to the right, placing your left hand on your right knee and your right hand behind you. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Cow Pose",
    "sanskrit_name": "Bitilasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 1,
    "id": 15,
    "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees under your hips. Inhale, arch your back, and lift your head and tailbone towards the ceiling. Exhale, return to a neutral spine."
  },
  {
    "english_name": "Crane (Crow) Pose",
    "sanskrit_name": "Bakasana",
    "pose_meta": [
      "Arm Balance",
      "Core"
    ],
    "difficulty": 3,
    "id": 16,
    "description": "Start in a squatting position with your feet hip-width apart. Place your hands on the floor in front of you, shoulder-width apart. Bend your elbows and lift your hips, bringing your knees to the backs of your upper arms. Shift your weight forward and lift your feet off the ground, balancing on your hands. Hold for several breaths."
  },
  {
    "english_name": "Dolphin Plank Pose",
    "sanskrit_name": "Makara Adho Mukha Svanasana",
    "pose_meta": [
      "Arm Balance",
      "Core",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 17,
    "description": "Start in a forearm plank position with your elbows under your shoulders and your body in a straight line. Engage your core and hold for several breaths."
  },
  {
    "english_name": "Dolphin Pose",
    "sanskrit_name": "Ardha Pincha Mayurasana",
    "pose_meta": [
      "Core",
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 18,
    "description": "Start on your hands and knees with your forearms on the floor, shoulder-width apart. Lift your hips towards the ceiling, forming an inverted V-shape with your body. Hold for several breaths."
  },
  {
    "english_name": "Downward-Facing Dog",
    "sanskrit_name": "Adho Mukha Svanasana",
    "pose_meta": [
      "Forward Bend",
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 19,
    "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees under your hips. Lift your hips towards the ceiling, forming an inverted V-shape with your body. Keep your spine straight and hold for several breaths."
  },
  {
    "english_name": "Eagle Pose",
    "sanskrit_name": "Garudasana",
    "pose_meta": [
      "Balancing",
      "Hip Opening",
      "Standing"
    ],
    "difficulty": 2,
    "id": 20,
    "description": "Stand with your feet together. Bend your knees slightly and lift your right foot, crossing your right thigh over your left. Wrap your right foot behind your left calf. Cross your left arm over your right and bring your palms together. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Easy Pose",
    "sanskrit_name": "Sukhasana",
    "pose_meta": [
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 1,
    "id": 21,
    "description": "Sit on the floor with your legs crossed and your hands resting on your knees. Keep your spine straight and your shoulders relaxed. Hold for several breaths."
  },
  {
    "english_name": "Eight-Angle Pose",
    "sanskrit_name": "Astavakrasana",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 3,
    "id": 22,
    "description": "Start in a seated position with your legs extended. Bend your knees and bring your feet to the floor. Place your right hand on the floor behind you and your left hand on your right knee. Inhale and lengthen your spine, then exhale and twist to the right. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Extended Hand-To-Big-Toe Pose",
    "sanskrit_name": "Utthita Hasta Padangustasana",
    "pose_meta": [
      "Balancing",
      "Hip Opening",
      "Standing"
    ],
    "difficulty": 3,
    "id": 23,
    "description": "Stand with your feet together. Lift your right leg and hold your big toe with your right hand. Extend your right leg forward, keeping your spine straight. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Extended Puppy Pose",
    "sanskrit_name": "Uttana Shishosana",
    "pose_meta": [
      "Forward Bend"
    ],
    "difficulty": 2,
    "id": 24,
    "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees under your hips. Walk your hands forward, lowering your chest towards the floor while keeping your hips lifted. Hold for several breaths."
  },
  {
    "english_name": "Extended Side Angle Pose",
    "sanskrit_name": "Utthita Parsvakonasana",
    "pose_meta": [
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 25,
    "description": "Stand with your feet wide apart. Turn your right foot out and bend your right knee, bringing your right thigh parallel to the floor. Place your right hand on the floor outside your right foot and extend your left arm over your head. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Extended Triangle Pose",
    "sanskrit_name": "Utthita Trikonasana",
    "pose_meta": [
      "Standing",
      "Strengthening"
    ],
    "difficulty": 1,
    "id": 26,
    "description": "Stand with your feet wide apart. Turn your right foot out and extend your arms parallel to the floor. Reach your right hand towards your right foot and extend your left arm towards the ceiling. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Feathered Peacock Pose",
    "sanskrit_name": "Pincha Mayurasana",
    "pose_meta": [
      "Inversion",
      "Strengthening"
    ],
    "difficulty": 3,
    "id": 27,
    "description": "Start in a forearm plank position with your elbows under your shoulders and your body in a straight line. Engage your core and lift one leg towards the ceiling. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Fire Log Pose",
    "sanskrit_name": "Agnistambhasana",
    "pose_meta": [
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 1,
    "id": 28,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Bring your left foot to the outside of your right hip. Inhale and lengthen your spine, then exhale and twist to the right, placing your left hand on your right knee and your right hand behind you. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Firefly Pose",
    "sanskrit_name": "Tittibhasana",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 3,
    "id": 29,
    "description": "Start in a squatting position with your feet hip-width apart. Place your hands on the floor in front of you, shoulder-width apart. Bend your elbows and lift your hips, bringing your knees to the backs of your upper arms. Shift your weight forward and lift your feet off the ground, balancing on your hands. Hold for several breaths."
  },
  {
    "english_name": "Fish Pose",
    "sanskrit_name": "Matsyasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 30,
    "description": "Lie on your back with your legs extended and your arms alongside your body. Inhale and lift your chest and legs off the floor, balancing on your sit bones. Keep your back straight and hold for several breaths."
  },
  {
    "english_name": "Four-Limbed Staff Pose",
    "sanskrit_name": "Chaturanga Dandasana",
    "pose_meta": [
      "Arm Balance",
      "Core",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 31,
    "description": "Start in a plank position with your wrists directly under your shoulders and your body in a straight line. Lower your body towards the floor, keeping your elbows close to your sides. Hold for several breaths."
  },
  {
    "english_name": "Garland Pose",
    "sanskrit_name": "Malasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 1,
    "id": 32,
    "description": "Stand with your feet wide apart and your toes turned out. Lower your hips into a squat position, bringing your hands together in front of your chest. Hold for several breaths."
  },
  {
    "english_name": "Gate Pose",
    "sanskrit_name": "Parighasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 1,
    "id": 33,
    "description": "Kneel on the floor with your knees hip-width apart. Extend your right leg to the side, keeping your foot flat on the floor. Inhale and raise your arms overhead, then exhale and lean to the right, placing your right hand on your right leg and extending your left arm over your head. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Half Frog Pose",
    "sanskrit_name": "Ardha Bhekasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 34,
    "description": "Lie on your stomach with your arms by your sides. Bend your right knee and reach back to hold your right ankle. Inhale and lift your chest and right thigh off the floor, pulling your ankle up and back. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Half Lord of the Fishes Pose",
    "sanskrit_name": "Ardha Matsyendrasana",
    "pose_meta": [
      "Hip Opening",
      "Seated",
      "Twist"
    ],
    "difficulty": 1,
    "id": 35,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Bring your left foot to the outside of your right hip. Inhale and lengthen your spine, then exhale and twist to the right, placing your left hand on your right knee and your right hand behind you. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Lying Half Lord of the Fishes Pose",
    "sanskrit_name": "Supta Matsyendrasana",
    "pose_meta": [
      "Hip Opening",
      "Restorative",
      "Twist"
    ],
    "difficulty": 1,
    "id": 36,
    "description": "Lie on your back with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Extend your arms out to the sides and gently twist your lower body to the left, bringing your right knee towards the floor. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Half Moon Pose",
    "sanskrit_name": "Ardha Chandrasana",
    "pose_meta": [
      "Balancing",
      "Standing"
    ],
    "difficulty": 2,
    "id": 37,
    "description": "Stand with your feet together. Lift your right leg and hold your right ankle with your right hand. Extend your right leg to the side, keeping your spine straight. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Handstand",
    "sanskrit_name": "Adho Mukha Vriksasana",
    "pose_meta": [
      "Balancing",
      "Inversion",
      "Strengthening"
    ],
    "difficulty": 3,
    "id": 38,
    "description": "Start in a standing position with your feet together. Place your hands on the floor in front of you, shoulder-width apart. Shift your weight onto your hands and lift your legs towards the ceiling, balancing on your hands. Hold for several breaths."
  },
  {
    "english_name": "Happy Baby Pose",
    "sanskrit_name": "Ananda Balasana",
    "pose_meta": [
      "Core"
    ],
    "difficulty": 1,
    "id": 39,
    "description": "Lie on your back and hug your knees to your chest. Grab the outsides of your feet with your hands and gently pull your knees towards the floor, keeping your ankles stacked over your knees. Hold for several breaths."
  },
  {
    "english_name": "Head-to-Knee Forward Bend",
    "sanskrit_name": "Janu Sirsasana",
    "pose_meta": [
      "Forward Bend",
      "Seated"
    ],
    "difficulty": 1,
    "id": 40,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot against your left inner thigh. Inhale and lengthen your spine, then exhale and fold forward over your left leg, reaching for your foot. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Hero Pose",
    "sanskrit_name": "Virasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 2,
    "id": 41,
    "description": "Kneel on the floor with your knees together. Sit back on your heels and place your hands on your thighs. Hold for several breaths."
  },
  {
    "english_name": "Heron Pose",
    "sanskrit_name": "Krounchasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 1,
    "id": 42,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Inhale and lengthen your spine, then exhale and twist to the right, placing your left hand on your right knee and your right hand behind you. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "High Lunge",
    "sanskrit_name": "Utthita Ashwa Sanchalanasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 1,
    "id": 43,
    "description": "Start in a standing position with your feet together. Step your right foot back and bend your left knee, lowering into a lunge position. Keep your right leg straight and your back heel lifted. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Intense Side Stretch Pose",
    "sanskrit_name": "Parsvottanasana",
    "pose_meta": [
      "Forward Bend",
      "Standing"
    ],
    "difficulty": 2,
    "id": 44,
    "description": "Stand with your feet together. Step your right foot back and bend your left knee, lowering into a lunge position. Straighten your left leg and fold forward over your left leg, reaching for your foot. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Legs-Up-the-Wall Pose",
    "sanskrit_name": "Viparita Karani",
    "pose_meta": [
      "Restorative"
    ],
    "difficulty": 1,
    "id": 45,
    "description": "Sit with your legs extended and your back against a wall. Lift your legs up the wall, keeping your hips as close to the wall as possible. Extend your arms out to the sides and hold for several breaths."
  },
  {
    "english_name": "Locust Pose",
    "sanskrit_name": "Salabhasana",
    "pose_meta": [
      "Chest Opening",
      "Strengthening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 46,
    "description": "Lie on your stomach with your arms by your sides. Inhale and lift your chest and legs off the floor, balancing on your lower abdomen. Hold for several breaths."
  },
  {
    "english_name": "Lord of the Dance Pose",
    "sanskrit_name": "Natarajasana",
    "pose_meta": [
      "Balancing",
      "Chest Opening",
      "Standing",
      "Backbends"
    ],
    "difficulty": 3,
    "id": 47,
    "description": "Stand with your feet together. Lift your right foot and hold your right ankle with your right hand. Extend your right leg behind you and reach your left arm forward, balancing on your left leg. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Lotus Pose",
    "sanskrit_name": "Padmasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 2,
    "id": 48,
    "description": "Sit with your legs crossed and your hands resting on your knees. Keep your spine straight and your shoulders relaxed. Hold for several breaths."
  },
  {
    "english_name": "Low Lunge",
    "sanskrit_name": "Anjaneyasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 2,
    "id": 49,
    "description": "Start in a standing position with your feet together. Step your right foot back and bend your left knee, lowering into a lunge position. Lower your right knee to the floor and extend your arms overhead. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Marichi’s Pose",
    "sanskrit_name": "Marichyasana III",
    "pose_meta": [
      "Hip Opening",
      "Seated",
      "Twist"
    ],
    "difficulty": 2,
    "id": 50,
    "description": "Sit with your legs extended. Bend your right knee and place your right foot on the floor outside your left thigh. Bring your left foot to the outside of your right hip. Inhale and lengthen your spine, then exhale and twist to the right, placing your left hand on your right knee and your right hand behind you. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Monkey Pose",
    "sanskrit_name": "Hanumanasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 3,
    "id": 51,
    "description": "Start in a kneeling position with your knees together. Step your right foot forward and lower your left hip towards the floor, extending your left leg behind you. Place your hands on the floor for support and hold for several breaths. Repeat on the other side."
  },
  {
    "english_name": "Mountain Pose",
    "sanskrit_name": "Tadasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 1,
    "id": 52,
    "description": "Stand with your feet together and your arms at your sides. Keep your spine straight and your shoulders relaxed. Hold for several breaths."
  },
  {
    "english_name": "Noose Pose",
    "sanskrit_name": "Pasasana",
    "pose_meta": [
      "Binding",
      "Hip Opening",
      "Strengthening",
      "Twist"
    ],
    "difficulty": 3,
    "id": 53,
    "description": "Stand with your feet together. Bend your knees and lower your hips into a squat position. Wrap your arms around your legs and twist your torso to the right, bringing your left elbow to the outside of your right knee. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "One-Legged King Pigeon Pose",
    "sanskrit_name": "Eka Pada Rajakapotasana",
    "pose_meta": [
      "Hip Opening",
      "Backbends"
    ],
    "difficulty": 3,
    "id": 54,
    "description": "Start in a kneeling position with your knees together. Step your right foot forward and lower your left hip towards the floor, extending your left leg behind you. Bend your left knee and reach back to hold your left ankle with your left hand. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "One-Legged King Pigeon Pose II",
    "sanskrit_name": "Eka Pada Rajakapotasana II",
    "pose_meta": [
      "Backbends"
    ],
    "difficulty": 3,
    "id": 55,
    "description": "Start in a kneeling position with your knees together. Step your right foot forward and lower your left hip towards the floor, extending your left leg behind you. Bend your left knee and reach back to hold your left ankle with your left hand. Hold for several breaths and repeat on the other side."
  },
  {
    "english_name": "Peacock Pose",
    "sanskrit_name": "Mayurasana",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 1,
    "id": 56,
    "description": "Start in a seated position with your legs extended. Bend your knees and place your hands on the floor behind you, fingers pointing towards your body. Lift your hips towards the ceiling and hold for several breaths."
  },
  {
    "english_name": "Pigeon Pose",
    "sanskrit_name": "Kapotasana",
    "pose_meta": [
      "Backbends"
    ],
    "difficulty": 3,
    "id": 57,
    "description": "Begin in a tabletop position. Slide your right knee forward towards your right wrist. Extend your left leg behind you, keeping the top of your foot on the floor. Ensure your hips are square and lean forward to rest on your forearms or forehead. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Plank Pose",
    "sanskrit_name": "Phalakasana",
    "pose_meta": [
      "Arm Balance",
      "Core",
      "Strengthening"
    ],
    "difficulty": 1,
    "id": 58,
    "description": "Start in a tabletop position with your hands directly under your shoulders and your knees under your hips. Step your feet back, one at a time, until your body forms a straight line from your head to your heels. Engage your core and hold for several breaths."
  },
  {
    "english_name": "Plow Pose",
    "sanskrit_name": "Halasana",
    "pose_meta": [
      "Inversion"
    ],
    "difficulty": 3,
    "id": 59,
    "description": "Lie on your back with your arms by your sides. Lift your legs over your head and bring your toes to the floor behind you. Keep your legs straight and your hands on your lower back for support. Hold for several breaths."
  },
  {
    "english_name": "Pose Dedicated to the Sage Koundinya I",
    "sanskrit_name": "Eka Pada Koundinyanasana I",
    "pose_meta": [
      "Arm Balance",
      "Twist"
    ],
    "difficulty": 3,
    "id": 60,
    "description": "Begin in a low lunge with your right foot forward. Twist your torso to the right and place your left hand on the floor. Lift your right leg and extend it to the side, balancing on your hands. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Pose Dedicated to the Sage Koundinya II",
    "sanskrit_name": "Eka Pada Koundinyanasana II",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 3,
    "id": 61,
    "description": "Begin in a low lunge with your right foot forward. Place your hands on the floor and lift your right leg, extending it to the side. Balance on your hands and hold for several breaths. Switch sides."
  },
  {
    "english_name": "Pose Dedicated to the Sage Marichi I",
    "sanskrit_name": "Marichyasana I",
    "pose_meta": [
      "Binding",
      "Forward Bend",
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 2,
    "id": 62,
    "description": "Sit with your legs extended in front of you. Bend your right knee and place your foot close to your left thigh. Twist your torso to the right and wrap your left arm around your right knee, bringing your right hand to the floor behind you. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Reclining Bound Angle Pose",
    "sanskrit_name": "Supta Baddha Konasana",
    "pose_meta": [
      "Hip Opening",
      "Restorative"
    ],
    "difficulty": 1,
    "id": 63,
    "description": "Lie on your back with your knees bent and the soles of your feet together. Let your knees fall open to the sides. Place your arms by your sides or on your abdomen. Hold for several breaths."
  },
  {
    "english_name": "Reclining Hand-to-Big-Toe Pose",
    "sanskrit_name": "Supta Padangusthasana",
    "pose_meta": [
      "Restorative"
    ],
    "difficulty": 2,
    "id": 64,
    "description": "Lie on your back with your legs extended. Lift your right leg and hold your big toe with your right hand. Keep your left leg grounded. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Reclining Hero Pose",
    "sanskrit_name": "Supta Virasana",
    "pose_meta": [
      "Restorative"
    ],
    "difficulty": 2,
    "id": 65,
    "description": "Sit on your heels with your knees together. Lean back and place your hands on the floor behind you. Lower your back to the floor, keeping your knees close together. Hold for several breaths."
  },
  {
    "english_name": "Revolved Head-to-Knee Pose",
    "sanskrit_name": "Parivrtta Janu Sirsasana",
    "pose_meta": [
      "Seated",
      "Twist"
    ],
    "difficulty": 1,
    "id": 66,
    "description": "Sit with your legs extended in front of you. Bend your right knee and place your foot against your left inner thigh. Extend your left arm towards your left foot and twist your torso to the right. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Revolved Side Angle Pose",
    "sanskrit_name": "Parivrtta Parsvakonasana",
    "pose_meta": [
      "Standing",
      "Strengthening",
      "Twist"
    ],
    "difficulty": 2,
    "id": 67,
    "description": "Stand with your feet wide apart. Turn your right foot out and bend your right knee. Reach your left arm towards the floor and your right arm towards the ceiling, twisting your torso to the right. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Revolved Triangle Pose",
    "sanskrit_name": "Parivrtta Trikonasana",
    "pose_meta": [
      "Standing",
      "Strengthening",
      "Twist"
    ],
    "difficulty": 2,
    "id": 68,
    "description": "Stand with your feet wide apart. Turn your right foot out and extend your arms parallel to the floor. Reach your left hand towards the floor and your right arm towards the ceiling, twisting your torso to the right. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Scale Pose",
    "sanskrit_name": "Tolasana",
    "pose_meta": [
      "Arm Balance",
      "Core"
    ],
    "difficulty": 2,
    "id": 69,
    "description": "Sit in a cross-legged position. Place your hands on the floor beside your hips. Lift your body off the floor using the strength of your arms and core. Hold for several breaths."
  },
  {
    "english_name": "Seated Forward Bend",
    "sanskrit_name": "Paschimottanasana",
    "pose_meta": [
      "Forward Bend",
      "Seated"
    ],
    "difficulty": 1,
    "id": 70,
    "description": "Sit with your legs extended in front of you. Reach forward with your hands towards your feet, keeping your spine long. Hold your feet or shins and fold forward, keeping your back straight. Hold for several breaths."
  },
  {
    "english_name": "Side Crane (Crow) Pose",
    "sanskrit_name": "Parsva Bakasana",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 3,
    "id": 72,
    "description": "Start in a squat position with your hands on the floor. Twist your torso to the right and place your left elbow on the outside of your right knee. Lift your feet off the floor and balance on your hands. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Side Plank Pose",
    "sanskrit_name": "Vasisthasana",
    "pose_meta": [
      "Arm Balance",
      "Balancing",
      "Core"
    ],
    "difficulty": 3,
    "id": 73,
    "description": "Start in a plank position. Shift your weight to your right hand and roll onto the outside edge of your right foot. Stack your left foot on top of your right foot and lift your left arm towards the ceiling. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Side-Reclining Leg Lift",
    "sanskrit_name": "Anantasana",
    "pose_meta": [
      "Balancing",
      "Core"
    ],
    "difficulty": 1,
    "id": 74,
    "description": "Lie on your right side with your legs extended. Place your right hand under your head for support. Lift your left leg towards the ceiling and hold your big toe with your left hand. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Sphinx Pose",
    "sanskrit_name": "Salamba Bhujangasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 1,
    "id": 75,
    "description": "Lie on your stomach with your elbows under your shoulders and your forearms on the floor. Press into your forearms and lift your chest off the floor, keeping your hips grounded. Hold for several breaths."
  },
  {
    "english_name": "Staff Pose",
    "sanskrit_name": "Dandasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 1,
    "id": 76,
    "description": "Sit with your legs extended in front of you and your hands by your sides. Press your hands into the floor and lengthen your spine. Flex your feet and engage your thighs. Hold for several breaths."
  },
  {
    "english_name": "Standing Forward Bend",
    "sanskrit_name": "Uttanasana",
    "pose_meta": [
      "Forward Bend"
    ],
    "difficulty": 2,
    "id": 77,
    "description": "Stand with your feet hip-width apart. Hinge at your hips and fold forward, reaching your hands towards the floor or your shins. Keep your knees slightly bent and your spine long. Hold for several breaths."
  },
  {
    "english_name": "Standing Half Forward Bend",
    "sanskrit_name": "Ardha Uttanasana",
    "pose_meta": [
      "Forward Bend",
      "Standing"
    ],
    "difficulty": 1,
    "id": 78,
    "description": "Stand with your feet hip-width apart. Hinge at your hips and fold forward, reaching your hands towards the floor. Lift your torso halfway up, keeping your back flat and your hands on your shins or the floor. Hold for several breaths."
  },
  {
    "english_name": "Standing Split",
    "sanskrit_name": "Urdhva Prasarita Eka Padasana",
    "pose_meta": [
      "Forward Bend",
      "Standing"
    ],
    "difficulty": 2,
    "id": 79,
    "description": "Stand with your feet together. Hinge at your hips and fold forward, reaching your hands towards the floor. Lift your right leg towards the ceiling, keeping your hips square. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Supported Headstand",
    "sanskrit_name": "Salamba Sirsasana",
    "pose_meta": [
      "Balancing",
      "Inversion"
    ],
    "difficulty": 3,
    "id": 80,
    "description": "Begin in a tabletop position with your forearms on the floor and your fingers interlaced. Place the crown of your head on the floor and lift your hips. Walk your feet towards your head and lift your legs towards the ceiling, coming into a headstand. Hold for several breaths."
  },
  {
    "english_name": "Supported Shoulderstand",
    "sanskrit_name": "Salamba Sarvangasana",
    "pose_meta": [
      "Balancing",
      "Inversion"
    ],
    "difficulty": 3,
    "id": 81,
    "description": "Lie on your back with your legs extended. Lift your legs over your head and place your hands on your lower back for support. Straighten your legs towards the ceiling, coming into a shoulderstand. Hold for several breaths."
  },
  {
    "english_name": "Tree Pose",
    "sanskrit_name": "Vriksasana",
    "pose_meta": [
      "Balancing",
      "Standing"
    ],
    "difficulty": 2,
    "id": 82,
    "description": "Stand with your feet together. Shift your weight to your left foot and place the sole of your right foot on your left inner thigh or calf. Bring your hands to your heart or overhead. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Upward Bow (Wheel) Pose",
    "sanskrit_name": "Urdhva Dhanurasana",
    "pose_meta": [
      "Chest Opening",
      "Strengthening",
      "Backbends"
    ],
    "difficulty": 3,
    "id": 83,
    "description": "Lie on your back with your knees bent and your feet on the floor. Place your hands beside your ears with your fingers pointing towards your shoulders. Press into your hands and feet to lift your hips and chest off the floor, coming into a backbend. Hold for several breaths."
  },
  {
    "english_name": "Upward Facing Two-Foot Staff Pose",
    "sanskrit_name": "Dwi Pada Viparita Dandasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 3,
    "id": 84,
    "description": "Begin in a bridge pose with your feet on the floor and your hands by your sides. Walk your hands towards your feet and lift your hips towards the ceiling. Straighten your legs and lift your chest, coming into an upward-facing staff pose. Hold for several breaths."
  },
  {
    "english_name": "Upward Plank Pose",
    "sanskrit_name": "Purvottanasana",
    "pose_meta": [
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 85,
    "description": "Sit with your legs extended in front of you and your hands behind your hips. Press into your hands and lift your hips towards the ceiling, coming into a reverse plank. Hold for several breaths."
  },
  {
    "english_name": "Upward Salute",
    "sanskrit_name": "Urdhva Hastasana",
    "pose_meta": [
      "Standing"
    ],
    "difficulty": 1,
    "id": 86,
    "description": "Stand with your feet together. Reach your arms overhead and bring your palms together. Lengthen through your spine and gaze towards your hands. Hold for several breaths."
  },
  {
    "english_name": "Upward-Facing Dog Pose",
    "sanskrit_name": "Urdhva Mukha Svanasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 87,
    "description": "Lie on your stomach with your hands under your shoulders and your elbows close to your sides. Press into your hands and lift your chest and thighs off the floor, keeping your arms straight. Hold for several breaths."
  },
  {
    "english_name": "Warrior I Pose",
    "sanskrit_name": "Virabhadrasana I",
    "pose_meta": [
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 88,
    "description": "Stand with your feet wide apart. Turn your right foot out and bend your right knee. Reach your arms overhead and gaze towards your hands. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Warrior II Pose",
    "sanskrit_name": "Virabhadrasana II",
    "pose_meta": [
      "Standing",
      "Strengthening"
    ],
    "difficulty": 2,
    "id": 89,
    "description": "Stand with your feet wide apart. Turn your right foot out and bend your right knee. Extend your arms parallel to the floor and gaze over your right hand. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Warrior III Pose",
    "sanskrit_name": "Virabhadrasana III",
    "pose_meta": [
      "Balancing",
      "Standing",
      "Strengthening"
    ],
    "difficulty": 3,
    "id": 90,
    "description": "Stand with your feet together. Lift your right leg behind you and hinge at your hips, extending your torso forward. Reach your arms forward and balance on your left leg. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Wide-Angle Seated Forward Bend",
    "sanskrit_name": "Upavistha Konasana",
    "pose_meta": [
      "Forward Bend",
      "Hip Opening",
      "Seated"
    ],
    "difficulty": 3,
    "id": 91,
    "description": "Sit with your legs extended wide apart. Hinge at your hips and fold forward, reaching your hands towards your feet or the floor. Keep your back straight and hold for several breaths."
  },
  {
    "english_name": "Wide-Legged Forward Bend",
    "sanskrit_name": "Prasarita Padottanasana",
    "pose_meta": [
      "Forward Bend",
      "Hip Opening",
      "Standing",
      "Strengthening"
    ],
    "difficulty": 1,
    "id": 92,
    "description": "Stand with your feet wide apart. Hinge at your hips and fold forward, reaching your hands towards the floor. Keep your back straight and hold for several breaths."
  },
  {
    "english_name": "Wild Thing",
    "sanskrit_name": "Camatkarasana",
    "pose_meta": [
      "Arm Balance",
      "Chest Opening"
    ],
    "difficulty": 2,
    "id": 93,
    "description": "Begin in a side plank position. Lift your top leg and place your foot behind you, turning your chest towards the ceiling. Reach your top arm overhead and hold for several breaths. Switch sides."
  },
  {
    "english_name": "Yogic Sleep",
    "sanskrit_name": "Yoganidrasana",
    "pose_meta": [
      "Forward Bend",
      "Seated"
    ],
    "difficulty": 3,
    "id": 94,
    "description": "Lie on your back with your arms by your sides and your legs extended. Close your eyes and relax your entire body. Focus on your breath and hold for several minutes."
  },
  {
    "english_name": "Scorpion Pose",
    "sanskrit_name": "Vrischikasana",
    "pose_meta": [
      "Backbends",
      "Inversion"
    ],
    "difficulty": 3,
    "id": 95,
    "description": "Begin in a forearm stand with your forearms on the floor and your legs extended towards the ceiling. Bend your knees and lower your feet towards your head, arching your back. Hold for several breaths."
  },
  {
    "english_name": "Thunderbolt Pose",
    "sanskrit_name": "Vajrasana",
    "pose_meta": [
      "Kneeling",
      "Seated"
    ],
    "difficulty": 1,
    "id": 96,
    "description": "Sit on your heels with your knees together and your hands on your thighs. Lengthen through your spine and hold for several breaths."
  },
  {
    "english_name": "Balance Pose",
    "sanskrit_name": "Tulasana",
    "pose_meta": [
      "Arm Balance"
    ],
    "difficulty": 2,
    "id": 97,
    "description": "Sit in a cross-legged position. Place your hands on the floor beside your hips. Lift your body off the floor using the strength of your arms and core. Hold for several breaths."
  },
  {
    "english_name": "Lion Pose",
    "sanskrit_name": "Simhasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 1,
    "id": 98,
    "description": "Sit on your heels with your knees apart. Place your hands on your knees and lean forward slightly. Open your mouth wide and stick your tongue out, roaring like a lion. Hold for several breaths."
  },
  {
    "english_name": "Crocodile Pose",
    "sanskrit_name": "Makarasana",
    "pose_meta": [
      "Restorative"
    ],
    "difficulty": 1,
    "id": 99,
    "description": "Lie on your stomach with your arms folded under your head. Rest your forehead on your arms and relax your entire body. Hold for several breaths."
  },
  {
    "english_name": "Pendant Pose",
    "sanskrit_name": "Lolasana",
    "pose_meta": [
      "Arm Balance",
      "Core"
    ],
    "difficulty": 3,
    "id": 100,
    "description": "Sit in a cross-legged position. Place your hands on the floor beside your hips. Lift your body off the floor using the strength of your arms and core. Hold for several breaths."
  },
  {
    "english_name": "Tortoise Pose",
    "sanskrit_name": "Kurmasana",
    "pose_meta": [
      "Forward Bend",
      "Seated"
    ],
    "difficulty": 3,
    "id": 101,
    "description": "Sit with your legs extended in front of you. Bend your knees and slide your arms under your legs. Reach your hands towards your feet and fold forward, bringing your forehead to the floor. Hold for several breaths."
  },
  {
    "english_name": "Embryo in Womb Pose",
    "sanskrit_name": "Garbha Pindasana",
    "pose_meta": [
      "Seated"
    ],
    "difficulty": 3,
    "id": 102,
    "description": "Sit with your legs crossed and your hands on your knees. Fold forward and bring your forehead to the floor, wrapping your arms around your legs. Hold for several breaths."
  },
  {
    "english_name": "Durvasasana",
    "sanskrit_name": "Durvasasana",
    "pose_meta": [
      "Standing",
      "Balancing"
    ],
    "difficulty": 3,
    "id": 103,
    "description": "Stand with your feet together. Lift your right leg and place your right foot behind your head. Balance on your left leg and hold for several breaths. Switch sides."
  },
  {
    "english_name": "Bhujapidasana",
    "sanskrit_name": "Bhujapidasana",
    "pose_meta": [
      "Arm Balance",
      "Core"
    ],
    "difficulty": 3,
    "id": 71,
    "description": "Start in a squat position. Place your hands on the floor in front of you and lift your hips. Slide your arms under your legs and press your hands into the floor. Lift your feet off the floor and balance on your hands. Hold for several breaths."
  },
  {
    "english_name": "Frog Pose",
    "sanskrit_name": "Bhekasana",
    "pose_meta": [
      "Chest Opening",
      "Backbends"
    ],
    "difficulty": 2,
    "id": 104,
    "description": "Begin in a tabletop position with your hands under your shoulders and your knees under your hips. Slide your knees out to the sides and lower your hips towards the floor. Keep your feet flexed and hold for several breaths."
  },
  {
    "english_name": "Formidable Pose",
    "sanskrit_name": "Bhairavasana",
    "pose_meta": [
      "Hip Opening"
    ],
    "difficulty": 2,
    "id": 105,
    "description": "Sit with your legs extended in front of you. Bend your right knee and place your right foot on the floor. Twist your torso to the right and place your left hand on the floor behind you. Hold for several breaths and switch sides."
  },
  {
    "english_name": "Formidable Face/Chin Stand Pose",
    "sanskrit_name": "Ganda Bherundasana",
    "pose_meta": [
      "Inversion",
      "Backbends",
      "Strengthening"
    ],
    "difficulty": 3,
    "id": 106,
    "description": "Begin in a forearm stand with your forearms on the floor and your legs extended towards the ceiling. Lower your chin towards the floor and balance on your forearms and chin. Hold for several breaths."
  }
]